apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_wdt.c
    case ESP32C3_WDT_STAGE2:
      {
        if (IS_RWDT(dev))
          {
            esp32c3_wdt_putreg(dev, RWDT_STAGE2_TIMEOUT_OFFSET, value);
          }
        else
          {
            esp32c3_wdt_putreg(dev, MWDT_STAGE2_TIMEOUT_OFFSET, value);
          }
        break;
      }

    case ESP32C3_WDT_STAGE3:
      {
        if (IS_RWDT(dev))
          {
            esp32c3_wdt_putreg(dev, RWDT_STAGE3_TIMEOUT_OFFSET, value);
          }
        else
          {
            esp32c3_wdt_putreg(dev, MWDT_STAGE3_TIMEOUT_OFFSET, value);
          }
        break;
      }

    default:
      {
        wderr("ERROR: unsupported stage %d\n", stage);
        ret = -EINVAL;
      }
  }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_wdt_feed
 *
 * Description:
 *   Feed the watchdog.
 *   The watchdog timer returns to stage 0 and its counter restarts from 0.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *
 ****************************************************************************/

static void esp32c3_wdt_feed(struct esp32c3_wdt_dev_s *dev)
{
  DEBUGASSERT(dev);

  if (IS_RWDT(dev))
    {
      esp32c3_wdt_modifyreg32(dev, RWDT_FEED_OFFSET, 0, RTC_CNTL_WDT_FEED);
    }
  else
    {
      esp32c3_wdt_putreg(dev, MWDT_FEED_OFFSET, TIMG_WDT_FEED);
    }
}

/****************************************************************************
 * Name: esp32c3_wdt_rtc_clk
 *
 * Description:
 *   Calculate the necessary cycles of RTC SLOW_CLK to complete
 *   1 ms.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *
 * Returned Values:
 *   Return the number of cycles that completes 1 ms.
 *
 ****************************************************************************/

static uint16_t esp32c3_wdt_rtc_clk(struct esp32c3_wdt_dev_s *dev)
{
  enum esp32c3_rtc_slow_freq_e slow_clk_rtc;
  uint32_t period_13q19;
  float period;
  float cycles_ms;
  uint16_t cycles_ms_int;

  /* Calibration map: Maps each RTC SLOW_CLK source to the number
   * used to calibrate this source.
   */

  static const enum esp32c3_rtc_cal_sel_e cal_map[] =
  {
    RTC_CAL_RTC_MUX,
    RTC_CAL_32K_XTAL,
    RTC_CAL_8MD256
  };

  DEBUGASSERT(dev);

  /* Check which clock is sourcing the slow_clk_rtc */

  slow_clk_rtc = esp32c3_rtc_clk_slow_freq_get();

  /* Get the slow_clk_rtc period in us in Q13.19 fixed point format */

  period_13q19 = esp32c3_rtc_clk_cal(cal_map[slow_clk_rtc],
                                     SLOW_CLK_CAL_CYCLES);

  /* Assert no error happened during the calibration */

  DEBUGASSERT(period_13q19 != 0);

  /* Convert from Q13.19 format to float */

  period = Q_TO_FLOAT(period_13q19);

  wdinfo("PERIOD: %f  %" PRIu32"\n", period, period_13q19);

  /* Get the number of cycles necessary to count 1 ms */

  cycles_ms = 1000.0f / period;

  /* Get the integer number of cycles */

  cycles_ms_int = (uint16_t)cycles_ms;

  return cycles_ms_int;
}

/****************************************************************************
 * Name: esp32c3_wdt_setisr
 *
 * Description:
 *   Allocate a Level CPU Interrupt, connect the peripheral source to this
 *   Interrupt, register the callback and enable the interrupt.
 *   In case a NULL handler is provided, deallocate the interrupt and
 *   unregister the previously provided handler.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *   handler       - Callback to be invoked on watchdog timer interrupt.
 *   arg           - Argument to be passed to the handler callback.
 *
 * Returned Values:
 *   Zero (OK) is returned on success; A negated errno value is returned
 *   to indicate the nature of any failure.
 *
 ****************************************************************************/

static int32_t esp32c3_wdt_setisr(struct esp32c3_wdt_dev_s *dev,
                                  xcpt_t handler,
                                  void *arg)
{
  struct esp32c3_wdt_priv_s *wdt = NULL;
  int32_t ret = OK;

  DEBUGASSERT(dev);

  wdt = (struct esp32c3_wdt_priv_s *)dev;

  /* Disable interrupt when callback is removed. */

  if (handler == NULL)
    {
#ifdef CONFIG_ESP32C3_RWDT
      if (wdt->irq == ESP32C3_IRQ_RTC_WDT)
        {
          esp32c3_rtcioirqdisable(wdt->irq);
          irq_detach(wdt->irq);
        }
      else
#endif
      if (wdt->cpuint != -ENOMEM)
        {
            {
              /* If a CPU Interrupt was previously allocated,
               * then deallocate it.
               */

              up_disable_irq(wdt->irq);
              irq_detach(wdt->irq);
              esp32c3_teardown_irq(wdt->periph, wdt->cpuint);
              wdt->cpuint = -ENOMEM;
            }
        }
    }

  /* Otherwise set callback and enable interrupt. */

  else
    {
#ifdef CONFIG_ESP32C3_RWDT
      if (wdt->irq == ESP32C3_IRQ_RTC_WDT)
        {
          ret = irq_attach(wdt->irq, handler, arg);

          if (ret != OK)
            {
              esp32c3_rtcioirqdisable(wdt->irq);
              tmrerr("ERROR: Failed to associate an IRQ Number");
            }

          esp32c3_rtcioirqenable(wdt->irq);
        }
      else
#endif
        {
          if (wdt->cpuint != -ENOMEM)
            {
              /* Disable the provided CPU interrupt to configure it. */

              up_disable_irq(wdt->irq);

              /* Free CPU interrupt that is attached to this peripheral
               * because we will get another from esp32c3_setup_irq()
               */

              esp32c3_teardown_irq(wdt->periph, wdt->cpuint);
            }

          wdt->cpuint = esp32c3_setup_irq(wdt->periph,
                                            ESP32C3_INT_PRIO_DEF,
                                            ESP32C3_INT_LEVEL);

          if (wdt->cpuint < 0)
            {
              return wdt->cpuint;
            }

          /* Attach and enable the IRQ. */

          ret = irq_attach(wdt->irq, handler, arg);
          if (ret != OK)
            {
              /* Failed to attach IRQ, so CPU interrupt must be freed. */

              esp32c3_teardown_irq(wdt->periph, wdt->cpuint);
              wdt->cpuint = -ENOMEM;
              return ret;
            }

          /* Enable the CPU interrupt that is linked to the WDT. */

          up_enable_irq(wdt->irq);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_wdt_enableint
 *
 * Description:
 *   Enable a Level Interrupt at timeout.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *
 ****************************************************************************/

static void esp32c3_wdt_enableint(struct esp32c3_wdt_dev_s *dev)
{
  DEBUGASSERT(dev);

  if (IS_RWDT(dev))
    {
      esp32c3_wdt_modifyreg32(dev, RWDT_INT_ENA_REG_OFFSET, 0,
                              RTC_CNTL_WDT_INT_ENA);
    }
  else
    {
      esp32c3_wdt_modifyreg32(dev, MWDT_INT_ENA_REG_OFFSET, 0,
                              TIMG_WDT_INT_ENA);
    }
}

/****************************************************************************
 * Name: esp32c3_wdt_disableint
 *
 * Description:
 *   Disable a Level Interrupt at timeout.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *
 ****************************************************************************/

static void esp32c3_wdt_disableint(struct esp32c3_wdt_dev_s *dev)
{
  DEBUGASSERT(dev);

  if (IS_RWDT(dev))
    {
      esp32c3_wdt_modifyreg32(dev, RWDT_INT_ENA_REG_OFFSET,
                              RTC_CNTL_WDT_INT_ENA, 0);
    }
  else
    {
      esp32c3_wdt_modifyreg32(dev, MWDT_INT_ENA_REG_OFFSET,
                              TIMG_WDT_INT_ENA, 0);
    }
}

/****************************************************************************
 * Name: esp32c3_wdt_ackint
 *
 *   Description:
 *   Acknowledge an interrupt.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *
 ****************************************************************************/

